cloudlab_scripts/mongo_journal_benchmark/update9_insert1_5000_j.out
mongo client connection created with mongodb://node0:27017
[OVERALL], RunTime(ms), 2749
[OVERALL], Throughput(ops/sec), 1818.8432157148054
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2385.0
[CLEANUP], MinLatency(us), 2384
[CLEANUP], MaxLatency(us), 2385
[CLEANUP], 95thPercentileLatency(us), 2385
[CLEANUP], 99thPercentileLatency(us), 2385
[UPDATE], Operations, 4516
[UPDATE], AverageLatency(us), 438.65611160318866
[UPDATE], MinLatency(us), 243
[UPDATE], MaxLatency(us), 70975
[UPDATE], 95thPercentileLatency(us), 997
[UPDATE], 99thPercentileLatency(us), 1243
[UPDATE], Return=OK, 4516
[INSERT], Operations, 484
[INSERT], AverageLatency(us), 411.22727272727275
[INSERT], MinLatency(us), 222
[INSERT], MaxLatency(us), 2833
[INSERT], 95thPercentileLatency(us), 926
[INSERT], 99thPercentileLatency(us), 1159
[INSERT], Return=OK, 484